config.el
;;; -*- lexical-binding: t; -*-

(setq user-full-name "Augustin Thiercelin"
      user-mail-address "augustin.thiercelin@epita.fr")

(setq org-directory "~/org/")

(display-battery-mode 1)
(setq display-line-numbers-type t)

(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))

(require 'dired-x)
(setq dired-omit-files "^\\...+$")
(add-hook 'dired-mode-hook (lambda () (dired-omit-mode 1)))

(map! :leader
      :desc "Go back to position before clicking link"
      "p p" #'org-mark-ring-goto)

(map! :leader
      :desc "Japanese"
      "j j" (cmd! (set-input-method "japanese"))
      :desc "Japanese Hiragana"
      "j h" (cmd! (set-input-method "japanese-hiragana"))
      :desc "Japanese Katakana"
      "j k" (cmd! (set-input-method "japanese-katakana")))

(defun book-faces (org-foreground org-background font)
  "Change org-faces"
  (interactive)

  (if (string= org-background "black")
      (setq block-background "#31314a")
    (setq block-background "LavenderBlush2"))

  (custom-set-faces!
    `(org-level-1 :inherit nil :family ,font :weight normal :slant normal :height 1.6 :foreground ,org-foreground)
    `(org-level-2 :inherit nil :family ,font :weight normal :slant italic :height 1.3 :foreground ,org-foreground)
    `(org-level-3 :inherit nil :family ,font :weight normal :slant italic :height 1.2 :foreground ,org-foreground)
    `(org-level-4 :inherit nil :family ,font :weight normal :slant italic :height 1.1 :foreground ,org-foreground)
    `(org-level-5 :inherit nil :family ,font :weight normal :slant italic :height 1.0 :foreground ,org-foreground)
    `(org-document-title :inherit nil :family ,font :height 1.8 :foreground ,org-foreground :underline nil)
    `(org-document-info :height 1.2 :slant italic)
    `(org-headline-done :family ,font :strike-through t)
    `(org-block :background ,block-background :family "Fira Mono" :height 0.7 :foreground ,org-foreground)
    `(org-block-begin-line :background nil :height 0.8 :family "sans-mono-font" :foreground "slate")
    `(org-block-end-line :background nil :height 0.8 :family "sans-mono-font" :foreground "slate")
    `(org-document-info-keyword :height 0.8 :foreground "gray")
    `(org-link :foreground ,org-foreground)
    `(org-special-keyword :family "sans-mono-font" :foreground "gray" :height 0.8)
    `(org-hide :foreground ,org-background)
    `(org-indent :inherit (org-hide fixed-pitch))
    `(org-date :family "sans-mono-font" :height 0.8)
    `(org-agenda-date :inherit nil :height 1.1)
    `(org-agenda-done :strike-through t :foreground "doc")
    `(org-ellipsis :underline nil :foreground "comment")
    `(org-tag :foreground "doc")
    `(org-table :family "serif-mono-font" :height 0.9 :background ,org-background)
    `(org-code :inherit nil :family "serif-mono-font" :foreground "comment" :height 0.9)
    `(org-meta-line :foreground "gray" :inherit org-document-info-keyword)
    `(org-drawer :foreground "gray" :inherit org-document-info-keyword)
    `(org-property-value :foreground "gray" :inherit org-document-info-keyword)
    `(variable-pitch :family ,font)
    )
  )

(defun black-theme ()
  (setq org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
  (load-theme 'doom-vibrant t)
  (book-faces "white" "black" "Fira Mono")
  )

(defun white-theme ()
  (setq org-superstar-headline-bullets-list '(" "))
  (load-theme 'spacemacs-light t)
  (book-faces "black" "white" "ETBembo")
  )

(defun swap-theme ()
  "Swap dark and light theme"
  (interactive)
  (if (eq doom-theme 'doom-vibrant)
      (white-theme)
    (black-theme)
    )
  )

(setq doom-font (font-spec :family "Fira Mono" :size 20 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Fira Mono" :size 22))

(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))

(setq theme_value (string-trim (get-string-from-file "~/.config/.theme")))
(if (string= theme_value "white")
    (white-theme)
  (black-theme))

(add-hook 'org-mode-hook (lambda ()
