config.org
* Org

Modify check-boxes inside org files.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda ()
   "Beautify Org Checkbox Symbol"
   (push '("[ ]" .  "☐") prettify-symbols-alist)
   (push '("[X]" . "☑" ) prettify-symbols-alist)
   (push '("[-]" . "❍" ) prettify-symbols-alist)
   (prettify-symbols-mode)))
#+end_src

Add margin and remove line indications
#+begin_src emacs-lisp
(setq visual-fill-column-width 110
      visual-fill-column-center-text t)

(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode 0)))
(add-hook 'org-mode-hook 'visual-fill-column-mode)
(add-hook 'org-mode-hook 'auto-fill-mode)
#+end_src

Add a customized function to take screenshot.
[[https://stackoverflow.com/questions/17435995/paste-an-image-on-clipboard-to-emacs-org-mode-file-without-saving-it][StackOverflow original code]]
#+begin_src emacs-lisp
(defun my-org-screenshot ()
  "Take a screenshot into a time stamped unique-named file in a
  subdirectory named as the org-buffer and insert a link to this file."
  (interactive)
  (setq path-no-ext (file-name-sans-extension buffer-file-name))
  (setq filename-no-ext (file-name-nondirectory path-no-ext))
  (setq screenshots-dir-name (concat path-no-ext "-screenshots"))
  (if (not (file-directory-p screenshots-dir-name))
      (make-directory screenshots-dir-name))
  (setq file-path
          (concat filename-no-ext "-screenshots/"
                  (format-time-string "%Y%m%d_%H%M%S.png")))
  (call-process "import" nil nil nil file-path)
  (setq caption (read-string "Caption: "))
  (insert (concat "#+CAPTION: " caption "\n"))
  (insert (concat "[[file:" file-path "]]")))
#+end_src


Export with properties and add options for minted latex export.
#+begin_src emacs-lisp
(setq org-export-with-properties t)
(setq org-latex-minted-options '(("linenos" "true") ("frame" "single")))
#+end_src

Add captures templates for org:
- *Todo* templates add a checkbox in dedicated sections inside the
    *~/org/todo.org* file.
- *Cours* templates open *~/org/roam/cours/cours_index.org* file to add an
   entry
- *Veille* templates open *~/org/veille.org* file to add a checkbox with the current
    day timetamp. A formated link with the clipboard content is set, needing a
    link description.
#+begin_src emacs-lisp
(setq org-capture-templates
      ;; Create new entry in org/todo.org in corresponding section
      '(("t" "Personal todo" entry
         (file+headline +org-capture-todo-file "MISC")
         "* [ ] %?\n%i\n%a"
         :prepend t)
        ("i" "SRS todo" entry
         (file+headline +org-capture-todo-file "SRS")
         "* [ ] %?\n%i\n%a"
         :prepend t)
        ("a" "ACU todo" entry
         (file+headline +org-capture-todo-file "ACU")
         "* [ ] %?\n%i\n%a"
         :prepend t)
        ("p" "PROLOGIN todo" entry
         (file+headline +org-capture-todo-file "PROLOGIN")
         "* [ ] %?\n%i\n%a"
         :prepend t)
        ;; Create new entry in org/notes.org
        ("n" "Personal notes" entry
         (file+headline "~/org/notes.org" "Notes")
         "* %u %?\n%i\n%a"
         :prepend t)
        ;; Add new entry in org/roam/cours/cours_index.org
        ("c" "Cours communs" entry
         (file+headline "~/org/roam/cours/cours_index.org" "Communs")
         "* %?\n%i\n%a"
         :jump-to-captured t)
        ("s" "Cours SRS" entry
         (file+headline "~/org/roam/cours/cours_index.org" "SRS")
         "* %?\n%i\n%a"
         :jump-to-captured t)
        ;; Add new entry in org/veille.org with clipboard
        ("v" "Veille SRS" entry
         (file+headline "~/org/veille.org" "Veille SRS")
         "* [ ] %u [[%x][%?]]\n%i\n%a"
         :prepend t)
        ("m" "Veille TCOM" entry
         (file+headline "~/org/veille.org" "Veille TCOM")
         "* [ ] %u [[%x][%?]]\n%i\n%a"
         :prepend t)))
#+end_src

* Org-roam

Basic configuration for roam, enabling version 2, setting the directory and
adding some bindings.
#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory (file-truename "~/org/roam/"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (org-roam-setup))
#+end_src

Add org-roam templates:
- *default* creating a file with a title and the current date
- *cours* creating a file inside *~/org/roam/cours* prompting for the name of
    the professor and adding readtheorg export option.
- *misc* creating a file inside *~/org/roam/misc* adding readthe org export option.
#+begin_src emacs-lisp
(setq org-roam-capture-templates
      '(("d" "default" plain "%?"
         :if-new (file+head "${slug}.org"
                            "#+TITLE: ${title}
,#+DATE: [%<%Y-%m-%d %j %H:%M:%S>]")
         :unnarrowed t)
        ("c" "cours" plain "%?"
         :if-new (file+head "cours/${slug}.org"
                            "#+TITLE: ${title}
,#+DATE: %U
,#+PROFESSOR: %^{PROF|FIXME}
,#+FILETAGS: :cours:
,#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
,#+HTML_LINK_HOME: cours_index.html
,#+HTML_LINK_LINK_UP: cours_index.html")
         :unnarrowed t)
        ("m" "misc" plain "%?"
         :if-new (file+head "misc/${slug}.org"
                            "#+TITLE: ${title}
,#+DATE: [%<%Y-%m-%d %j %H:%M:%S>]
,#+FILETAGS: :misc:
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
,#+HTML_LINK_HOME: misc_index.html
,#+HTML_LINK_LINK_UP: misc_index.html'")
         :unnarrowed t)))
#+end_src

Add templates for roam-daily:
- *cours* adding it in section "Notes de cours"
- *misc* adding it in section "Notes generales"
#+begin_src emacs-lisp
(setq org-roam-dailies-capture-templates
      '(("c" "cours" entry "* %?"
         :if-new (file+head "daily/%<%Y-%m-%d>.org"
         "#+TITLE: %<%Y-%m-%d>\n")
         :olp ("Notes de cours"))

        ("m" "misc" entry "* %?"
         :file-name "daily/%<%Y-%m-%d>.org"
         :head "#+TITLE: %<%Y-%m-%d>\n"
         :olp ("Notes generales"))))
#+end_src

* Publish

Setup two project to publish:
- *cours* exporting all org-roam files with ressources from *~/org/roam/cours*
- *misc* exporting all org-roam file with ressources from *~/org/roam/misc*
#+begin_src emacs-lisp
(require 'ox-publish)
(setq org-publish-project-alist
      '(
        ("cours-note"
         :base-directory "~/org/roam/cours"
         :base-extension "org"
         :publishing-directory "~/cours/public_html/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :auto-preamble t)
        ("cours-static"
         :base-directory "~/org/roam/cours"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/cours/public_html/"
         :recursive t
         :publishing-function org-publish-attachment)
        ("misc-note"
         :base-directory "~/org/roam/misc"
         :base-extension "org"
         :publishing-directory "~/misc/public_html/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :auto-preamble t)
        ("misc-static"
         :base-directory "~/org/roam/misc"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/misc/public_html/"
         :recursive t
         :publishing-function org-publish-attachment)
        ("cours" :components ("cours-note" "cours-static"))
        ("misc" :components ("misc-note" "misc-static"))))
#+end_src

Force pushing even if files didn't change
#+begin_src emacs-lisp
(setq org-publish-use-timestamps-flag 'nil)
#+end_src

Honestly, I don't remember those lines
#+begin_src emacs-lisp
(require 'ox-latex)
(add-to-list 'org-latex-packages-alist '("" "minted"))
(setq org-latex-listings 'minted)

(setq org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

