config.el

(setq org-static-blog-publish-title "blog n1tsu")
(setq org-static-blog-publish-url "https://blog.n1tsu.com/")
(setq org-static-blog-publish-directory "~/org/blog/")
(setq org-static-blog-posts-directory "~/org/blog/posts/")
(setq org-static-blog-drafts-directory "~/org/blog/drafts/")
(setq org-static-blog-enable-tags t)
(setq org-export-with-toc nil)
(setq org-export-with-section-numbers nil)
(setq org-static-blog-use-preview t)

(setq org-static-blog-page-header
      "<meta name=\"author\" content=\"Augustin Thiercelin\">
<meta name=\"referrer\" content=\"no-referrer\">
<link href= \"static/style.css\" rel=\"stylesheet\" type=\"text/css\" />
<link rel=\"icon\" href=\"static/favicon.ico\">")

(setq org-static-blog-page-preamble
      "<div class=\"header\">
<a href=\"https://n1tsu.com\">Page principale</a> ; <a href=\"https://blog.n1tsu.com\">Index</a> ;</div>
<h1 class=\"main-title\">Cybercarnet</h1>
<div class=\"sub-body\">
")

(setq org-static-blog-page-postamble
      "</div><div class=\"love\"<center>Créé avec 💟 par GNU Emacs et 🦄 org mode</center></div>")

(setq org-static-blog-index-front-matter
      "")

(setq org-static-blog-langcode "fr")


(defun org-static-blog-post-preamble-override (post-filename)
  (concat
   "<h1 class=\"post-title\">"
   "<a href=\"" (org-static-blog-get-post-url post-filename) "\">" (org-static-blog-get-title post-filename) "</a>"
   "</h1>\n"
   "<div class=\"top-post\">"
   "<div class=\"post-date\"><" (format-time-string (org-static-blog-gettext 'date-format)
                                                   (org-static-blog-get-date post-filename))
   "></div>"
   "<div class=\"taglist\">" (org-static-blog-post-taglist post-filename) "</div></div>"))

(defun org-static-blog-post-postamble-override (post-filename)
  (if (string= org-static-blog-post-comments "")
      ""
    (concat "\n<div id=\"comments\">"
            org-static-blog-post-comments
            "</div>")))

(defun org-static-blog-get-preview-override (post-filename)
  (with-temp-buffer
    (insert-file-contents (org-static-blog-matching-publish-filename post-filename))
    (let ((post-title (org-static-blog-get-title post-filename))
          (post-date (org-static-blog-get-date post-filename))
          (post-taglist (org-static-blog-post-taglist post-filename))
          (post-ellipsis "")
          (preview-region (org-static-blog--preview-region)))
      (when (and preview-region (search-forward "<p>" nil t))
        (setq post-ellipsis
              (concat (when org-static-blog-preview-link-p
                        (format "<a href=\"%s\">"
                                (org-static-blog-get-post-url post-filename)))
                      org-static-blog-preview-ellipsis
                      (when org-static-blog-preview-link-p "</a>\n"))))
      ;; Put the substrings together.
      (let ((title-link
             (format "<h2 class=\"post-title\"><a href=\"%s\">%s</a></h2>"
                     (org-static-blog-get-post-url post-filename) post-title))
            (date-link
             (format-time-string (concat "<div class=\"post-date\"><"
                                         (org-static-blog-gettext 'date-format)
                                         "></div>")
                                 post-date)))
        (concat title-link "<div class=\"top-post\">" date-link
         (format "<div class=\"taglist\">%s</div>" post-taglist)
         "</div>"
         preview-region
         post-ellipsis)))))

(defun org-static-blog-post-taglist-override (post-filename)
  (let ((taglist-content "")
        (tags (remove org-static-blog-rss-excluded-tag
                      (org-static-blog-get-tags post-filename))))
    (when (and tags org-static-blog-enable-tags)
      (dolist (tag tags)
        (setq taglist-content (concat taglist-content "<a href=\""
                                      (org-static-blog-get-absolute-url (concat "tag-" (downcase tag) ".html"))
                                      "\">:" tag ":</a> "))))
    taglist-content))

(advice-add  'org-static-blog-post-preamble :override #'org-static-blog-post-preamble-override)
(advice-add  'org-static-blog-post-postamble :override #'org-static-blog-post-postamble-override)
(advice-add  'org-static-blog-get-preview :override #'org-static-blog-get-preview-override)
(advice-add  'org-static-blog-post-taglist :override #'org-static-blog-post-taglist-override)
